curse_words = ['сука', 'бля', 'пизда', 'хуй', 'пидарас',
               'пидор', 'пидр', 'вагина', 'блять', 'блядь', 'ебать',
               'уебать', 'заебал', 'пиздец']

text1851 = '1851\n\nВ Казань приехала группа итальянских оперных певцов во главе с Амалией Корбари ' \
           '– так казанцы впервые познакомились с профессиональными оперными артистами. Гастроли ' \
           'прошли в только что выстроенном в центре Казани каменном здании театра.'
img1851 = '1851.jpg'

text1874 = '1874\n\nАнтрепренер, «собиратель русской сцены» Петр Михайлович Медведев' \
           ' сформировал постоянную оперную труппу с солистами, хором, оркестром и' \
           ' балетной группой и 26 августа представил казанской публике оперу М.Глинки' \
           ' «Жизнь за царя». Эта дата – 26 августа 1874 года - является точкой отсчета ' \
           'постоянных оперных сезонов в Казани.Государственных оперных театров с постоянной ' \
           'труппой в то время в России было всего два: Мариинский в Петербурге и Большой в Москве;' \
           ' в провинции оперные труппы представляли из себя частную антрепризу. ' \
           'К 1870-м годам постоянные оперные сезоны были только в Киеве и Одессе,' \
           ' Московская частная опера C.И.Мамонтова открылась в 1885 году, опера С.И.Зимина' \
           ' в Москве появилась лишь в 1904 году, так что Казань стала третьим городом в провинции, ' \
           'который обзавёлся собственной оперной труппой, дававшей представления на протяжении всего ' \
           'театрального сезона.'
img1874 = '1874.jpg'

text1936 = '1936\n\nВозведение нового здания началось в 1936 году по проекту московского архитектора ' \
           'Николая Скворцова. В дальнейшем казанский архитектор Исмагил Гайнутдинов внес в проект' \
           ' коррективы. В связи с начавшейся Великой Отечественной войной строительство здания театра ' \
           'затянулось на 20 лет.'
img1936 = '1936.jpg'

textXV = 'Казанцы впервые знакомятся с оперным искусством. 1791 год - начало общедоступных театральных ' \
         'представлений в Казани (в первой мужской гимназии). В гимназическом театре вскоре была учреждена' \
         ' должность капельмейстера, что связано с постановкой не только драматических, но и оперных спектаклей.'
imgXV = 'XV.jpg'

texts = [text1851, text1874, text1936, textXV]
imgs = [img1851, img1874, img1936, imgXV]